# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

my_list = input("Введите предложение:").split(sep=' ')

for num, item in enumerate(my_list):
    print(num, item[:10])
